# Security

1password

# User experience

rectangle
karabiner-elements
lunar
logi-options+

# Development

docker
visual-studio-code
iterm2
insomnia

# DB and data work
dbeaver-community
rstudio
quarto

# Fonts

font-fira-code
font-hack-nerd-font # non-ASCII dev glyphs

# Communication and collaboration

slack
discord
loom
zoom
signal
asana
webex # Tableau support sessions

# Extra storage

onedrive

# Browsing

google-chrome
firefox # temp? experimental; for ACL YouTube playlist editing

# Second brain and AI

obsidian
notion
chatgpt

# Hobby

ableton-live-suite@11

# Entertainment

spotify
