# Security

1password

# Development

docker
visual-studio-code
iterm2

# Customization

zsh-syntax-highlighting
zsh-autosuggestions
font-fira-code
font-hack-nerd-font # non-ASCII dev glyphs

# Communication and collaboration

slack
loom
zoom
signal

# Browsing

google-chrome

# Second brain and AI

obsidian
notion
chatgpt

# TypeScript development

node
nvm
pnpm
vercel-cli

# Hobby

ableton-live-suite@11
